
/**********************************************************************************************************************/
/*Класс с игровым полем и всеми действиями с ним*/
/**********************************************************************************************************************/
public class pole3x3 {

    private final static byte bt_empty = 2; //Обозначение пустых ячеек в массиве
    private static byte bt_user_znak = -1; //чем играет пользователь: крестиком(1) или ноликом(0)
    private static byte bt_comp_znak = -1; //чем играет компьютер: крестиком(1) или ноликом(0)
    private static byte[] pole = {-1,-1,-1, -1,-1,-1, -1,-1,-1};

    /******************************************************************************************************************/
    /* pole3x3 - инициализируем поле
    Параметры: byte b_user_znak - каким символом ходит пользователь: крестик(true) или нолик(false)?
    */
    /******************************************************************************************************************/

    public void pole3x3(boolean b_user_znak) {

        bt_user_znak = (byte)((b_user_znak) ? 1 : 0);

        for(byte i = 0; i < pole.length; i++){
            pole[i] = bt_empty;
        }

    }

    /******************************************************************************************************************/
    /* print_pole - отображаем поле на экране
    внешняя индексация для пользователя:
    1 2 3
    4 5 6
    7 8 9
    внутренний программный вид:
    0 1 2
    3 4 5
    6 7 8
    Обозначения:
    1 - крестик
    0 - нолик
    2(любое другое число) - отображается номер ячейки*/
    /******************************************************************************************************************/

    public void print_pole() {
        System.out.println("\n================================================");
        System.out.println("------------------");
        String str_print= "|";
        for(byte i = 0; i < pole.length; i++) {

            str_print += "  ";

            if (pole[i] == 1) {
                str_print += 'X';
            } else if (pole[i] == 0) {
                str_print += '0';
            } else {
                str_print += (i+1);
            }

            str_print += "  ";

            if ((i == 2) || (i == 5) || (i == 8)) str_print += " |\n";
            if ((i == 2) || (i == 5)) str_print += "|----------------|\n|";

        }
        System.out.print(str_print);
        System.out.println("------------------\n");
    }

    /******************************************************************************************************************/
    /* test_index - проверяем чем занята данная конкретная ячейка на поле
    Параметры: byte bt_index - индекс ячейки которую проверяем
    0 1 2
    3 4 5
    6 7 8
    Возвращаемое значение:
    0 - ячейка пуста
    1 - юзер(нолик или крестик не важно)
    2 - компьютер(нолик или крестик не важно)
    */
    /******************************************************************************************************************/

    public byte test_index(byte bt_index) {

        if (pole[bt_index] == bt_user_znak) {
            //Ячейка занята юзером
            return 1; //единица в данном случае обозначение места занятого под знак юзера

        } else if (pole[bt_index] == bt_comp_znak) {
            //Ячейка занята компьютером
            return 2; //единица в данном случае обозначение места занятого под знак компьютера

        }

        //Любое другое значение в ячейке
        return 0;

    }


}
